iakov/trik_msp430_firmware_usb/Trik_Devices/trik_protocolhandler.c
    // PWM registers addresses range
    if (((devaddr1>=PWM1) && (devaddr1<=PWM4)) && (regaddr1>0x03))
    {
        PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,REG_ADDR_ERROR);
        return REG_ADDR_ERROR;
    }

    // Software PWM registers addresses range
    if (((devaddr1>=SPWM1) && (devaddr1<=SPWM14)) && (regaddr1>0x03))
    {
        PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,REG_ADDR_ERROR);
        return REG_ADDR_ERROR;
    }

    // I2C registers addresses range
    if (((devaddr1>=I2C1) && (devaddr1<=I2C7)) && (regaddr1>0x09))
    {
        PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,REG_ADDR_ERROR);
        return REG_ADDR_ERROR;
    }

    // USART registers addresses range
    if (((devaddr1>=USART1) && (devaddr1<=USART7)) && (regaddr1>0x03))
    {
        PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,REG_ADDR_ERROR);
        return REG_ADDR_ERROR;
    }

    // Timer registers addresses range
    if ((devaddr1==ASYNCTIMER) && (regaddr1>0x03))
    {
        PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,REG_ADDR_ERROR);
        return REG_ADDR_ERROR;
    }

    // Touch controller registers addresses range
    if ((devaddr1==TOUCHDEVICE) && (regaddr1>0x09))
    {
        PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,REG_ADDR_ERROR);
        return REG_ADDR_ERROR;
    }

    // BSL registers addresses range
    if ((devaddr1==BSL) && (regaddr1>0x01))
    {
        PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,REG_ADDR_ERROR);
        return REG_ADDR_ERROR;
    }

    // Version control registers addresses range
    if ((devaddr1==VERSIONCTRL) && (regaddr1>0x0C))
    {
        PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,REG_ADDR_ERROR);
        return REG_ADDR_ERROR;
    }

	// Function number check
	if ((func1!=FUNC_WRITE) && (func1!=FUNC_READ))
	{
	    PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,FUNC_CODE_ERROR);
		return FUNC_CODE_ERROR;
	}

	// CRC check
	switch (func1)
	{
        case FUNC_WRITE:
            crc1 = hex2num(in_str, 15, NUM_BYTE);
            break;
        case FUNC_READ:
            crc1 = hex2num(in_str, 7, NUM_BYTE);
            break;
        default:
            break;
	}

	if ((func1==FUNC_WRITE))
	    crc2=0-(devaddr1+func1+regaddr1+
	            (uint8_t)(regval1 & 0x000000FF)+(uint8_t)((regval1 & 0x0000FF00) >> 8)+
	            (uint8_t)((regval1 & 0x00FF0000) >> 16)+(uint8_t)((regval1 & 0xFF000000) >> 24));
	if ((func1==FUNC_READ))
	    crc2=0-(devaddr1+func1+regaddr1);
	if (crc1!=crc2)
	{
	    PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,CRC_ERROR);
	    return CRC_ERROR;
	}

	// Hadle of function 0x03 - write single register
	if ((func1==FUNC_WRITE) && (strlen(in_str)==17))
	{
	    // Motors
	    // if ((devaddr1>=MOTOR1) && (devaddr1<=MOTOR4))
	    if ((devaddr1<=MOTOR4))
	    {
	        if (regaddr1==MMDUT)
	            MOT[devaddr1].MDUT = regval1;
	        if (regaddr1==MMPER)
	            MOT[devaddr1].MPER = regval1;
	        if (regaddr1==MMANG)
	            MOT[devaddr1].MANG = regval1;
	        if (regaddr1==MMTMR)
	            MOT[devaddr1].MTMR = regval1;
	        if (regaddr1==MMVAL)
	            MOT[devaddr1].MVAL = regval1;
            if (regaddr1==MMERR)
                MOT[devaddr1].MERR = regval1;
	        if (regaddr1==MMCTL)
	            MOT[devaddr1].MCTL = regval1;
            // Error register values
            if ((MOT[devaddr1].MPER==0) || (MOT[devaddr1].MDUT>MOT[devaddr1].MPER))
            {
                PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,REG_INC_ERROR);
                return REG_INC_ERROR;
            }
            MOTOR_handler(devaddr1);
            PROTOCOL_recvResponse(out_str,devaddr1,func1,regaddr1,MOT[devaddr1].MSTA);
            return NO_ERROR;
	    }

	    // Encoders
        if ((devaddr1>=ENCODER1) && (devaddr1<=ENCODER4))
        {
            if (regaddr1==EEVAL)
                ENC[devaddr1-ENCODER1].EVAL = regval1;
            if (regaddr1==EECTL)
            {
                ENC[devaddr1-ENCODER1].ECTL = regval1;
                ENCODER_handler(devaddr1);
            }
            PROTOCOL_recvResponse(out_str,devaddr1,func1,regaddr1,ENC[devaddr1-ENCODER1].ESTA);
            return NO_ERROR;
        }

        // Sensors
        if ((devaddr1>=SENSOR1) && (devaddr1<=SENSOR18))
        {
            if (regaddr1==SSIDX)
                SENS[devaddr1-SENSOR1].SIDX = regval1;
            if (regaddr1==SSCTL)
            {
                SENS[devaddr1-SENSOR1].SCTL = regval1;
                SENSOR_handler(devaddr1);
            }
            PROTOCOL_recvResponse(out_str,devaddr1,func1,regaddr1,SENS[devaddr1-SENSOR1].SSTA);
            return NO_ERROR;
        }

        // Ports
        if ((devaddr1>=PORT1) && (devaddr1<=PORTJ))
        {
            PORT_write(devaddr1, regaddr1, regval1);
            PROTOCOL_recvResponse(out_str,devaddr1,func1,regaddr1,NO_ERROR);
            return NO_ERROR;
        }

        // PWMs
        if ((devaddr1>=PWM1) && (devaddr1<=PWM4))
        {
            if (regaddr1==PPDUT)
                PWM[devaddr1-PWM1].PDUT = regval1;
            if (regaddr1==PPPER)
                PWM[devaddr1-PWM1].PPER = regval1;
            if (regaddr1==PPCTL)
                PWM[devaddr1-PWM1].PCTL = regval1;
            PWM_handler(devaddr1);
            PROTOCOL_recvResponse(out_str,devaddr1,func1,regaddr1,NO_ERROR);
            return NO_ERROR;
        }

        // Software PWMs
        if ((devaddr1>=SPWM1) && (devaddr1<=SPWM14))
        {
            if (regaddr1==SPPDUT)
                SPWM[devaddr1-SPWM1].SPDUT = regval1;
            if (regaddr1==SPPPER)
                SPWM[devaddr1-SPWM1].SPPER = regval1;
            if (regaddr1==SPPCTL)
                SPWM[devaddr1-SPWM1].SPCTL = regval1;
            SPWM_handler(devaddr1);
            PROTOCOL_recvResponse(out_str,devaddr1,func1,regaddr1,NO_ERROR);
            return NO_ERROR;
        }

        // I2Cs
        if ((devaddr1>=I2C1) && (devaddr1<=I2C7))
        {
            if (regaddr1==IIDEV)
                I2C[devaddr1-I2C1].IDEV = regval1;
            if (regaddr1==IIREG)
                I2C[devaddr1-I2C1].IREG = regval1;
            if (regaddr1==IIDAT)
                I2C[devaddr1-I2C1].IDAT = regval1;
            if (regaddr1==IIERR)
                I2C[devaddr1-I2C1].IERR = regval1;
            if (regaddr1==IIIDX)
                I2C[devaddr1-I2C1].IIDX = regval1;
            if (regaddr1==IIVAL)
                I2C[devaddr1-I2C1].IVAL = regval1;
            if (regaddr1==IIPAR)
                I2C[devaddr1-I2C1].IPAR = regval1;
            if (regaddr1==IIDEL)
                Idelay = regval1;
            if (regaddr1==IICTL)
            {
                I2C[devaddr1-I2C1].ICTL = regval1;
                I2C_handler(devaddr1);
            }
            PROTOCOL_recvResponse(out_str,devaddr1,func1,regaddr1,NO_ERROR);
            return NO_ERROR;
        }

        // USARTs
        if ((devaddr1>=USART1) && (devaddr1<=USART7))
        {
            if (regaddr1==UUCTL)
            {
                USART[devaddr1-USART1].UCTL = regval1;
                if (regval1 & USART_RST)
                	USART_reset(devaddr1);
                if (regval1 & USART_EN)
                	USART_init(devaddr1, regval1);
                else
                	USART_disable(devaddr1);
            }
            if (regaddr1==UUSPD)
            {
            	USART[devaddr1-USART1].USPD = regval1;
            	USART_set_speed(devaddr1, regval1);
            }
            if (regaddr1==UUDAT)
            {
            	USART[devaddr1-USART1].UDAT = regval1;
            	USART_transmit_byte(devaddr1, regval1);
            }
            PROTOCOL_recvResponse(out_str,devaddr1,func1,regaddr1,NO_ERROR);
            return NO_ERROR;
        }

        // Async timer
        if ((devaddr1==ASYNCTIMER))
        {
            if (regaddr1==AATPER)
                ASYNCTMR.ATPER = regval1 + MAX_DEVICES;
            if (regaddr1==AATVAL)
                ASYNCTMR.ATVAL = regval1;
            if (regaddr1==AATCTL)
            {
                ASYNCTMR.ATCTL=regval1;
                ASYNCTIMER_handler();
            }
            PROTOCOL_recvResponse(out_str,devaddr1,func1,regaddr1,NO_ERROR);
            return NO_ERROR;
        }

        // Touch controller
        if ((devaddr1==TOUCHDEVICE))
        {
            if (regaddr1==TTMOD)
            {
                TOUCH.TMOD = regval1;
                if (regval1) resetTouch();
            }
            if (regaddr1==TMINX)
                TOUCH.MINX = regval1;
            if (regaddr1==TMAXX)
                TOUCH.MAXX = regval1;
            if (regaddr1==TMINY)
                TOUCH.MINY = regval1;
            if (regaddr1==TMAXY)
                TOUCH.MAXY = regval1;
            if (regaddr1==TSCRX)
                TOUCH.SCRX = regval1;
            if (regaddr1==TSCRY)
                TOUCH.SCRY = regval1;
            if (regaddr1==TCURX)
                TOUCH.CURX = regval1;
            if (regaddr1==TCURY)
                TOUCH.CURY = regval1;
            PROTOCOL_recvResponse(out_str,devaddr1,func1,regaddr1,NO_ERROR);
            return NO_ERROR;
        }

	    // BSL
	    if ((devaddr1==BSL) && (regaddr1==0x00))
	    {
	        PROTOCOL_recvResponse(out_str,devaddr1,func1,regaddr1,BSL_enterBSL(regval1));
	        return NO_ERROR;
	    }

