iakov/trik_msp430_firmware_usb/Trik_Devices/trik_protocolhandler.c
	    // If not found any devices
	    PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,DEV_ADDR_ERROR);
	    return DEV_ADDR_ERROR;
	}

	// Function 0x05 - read single register
    if ((func1==FUNC_READ) && (strlen(in_str)==9))
    {
        // Motors
        // if ((devaddr1>=MOTOR1) && (devaddr1<=MOTOR4))
        if ((devaddr1<=MOTOR4))
        {
            if (regaddr1==MMCTL)
                PROTOCOL_recvResponse(out_str,devaddr1,MOT[devaddr1].MSTA,regaddr1,MOT[devaddr1].MCTL);
            if (regaddr1==MMDUT)
                PROTOCOL_recvResponse(out_str,devaddr1,MOT[devaddr1].MSTA,regaddr1,MOT[devaddr1].MDUT);
            if (regaddr1==MMPER)
                PROTOCOL_recvResponse(out_str,devaddr1,MOT[devaddr1].MSTA,regaddr1,MOT[devaddr1].MPER);
            if (regaddr1==MMANG)
                PROTOCOL_recvResponse(out_str,devaddr1,MOT[devaddr1].MSTA,regaddr1,MOT[devaddr1].MANG);
            if (regaddr1==MMTMR)
                PROTOCOL_recvResponse(out_str,devaddr1,MOT[devaddr1].MSTA,regaddr1,MOT[devaddr1].MTMR);
            if (regaddr1==MMVAL)
                PROTOCOL_recvResponse(out_str,devaddr1,MOT[devaddr1].MSTA,regaddr1,MOT[devaddr1].MVAL);
            if (regaddr1==MMERR)
                PROTOCOL_recvResponse(out_str,devaddr1,MOT[devaddr1].MSTA,regaddr1,MOT[devaddr1].MERR);
            if (regaddr1==MMVER)
                PROTOCOL_recvResponse(out_str,devaddr1,MOT[devaddr1].MSTA,regaddr1,MOTOR_VERSION);
            return NO_ERROR;
        }

        // Encoders
        if ((devaddr1>=ENCODER1) && (devaddr1<=ENCODER4))
        {
            if (regaddr1==EECTL)
                PROTOCOL_recvResponse(out_str,devaddr1,ENC[devaddr1-ENCODER1].ESTA,regaddr1,ENC[devaddr1-ENCODER1].ECTL);
            if (regaddr1==EEVAL)
                PROTOCOL_recvResponse(out_str,devaddr1,ENC[devaddr1-ENCODER1].ESTA,regaddr1,ENC[devaddr1-ENCODER1].EVAL);
            if (regaddr1==EEVER)
                PROTOCOL_recvResponse(out_str,devaddr1,ENC[devaddr1-ENCODER1].ESTA,regaddr1,ENCODER_VERSION);
            return NO_ERROR;
        }

        // Sensors
        if ((devaddr1>=SENSOR1) && (devaddr1<=SENSOR18))
        {
            SENSOR_handler(devaddr1);
            if (regaddr1==SSCTL)
                PROTOCOL_recvResponse(out_str,devaddr1,SENS[devaddr1-SENSOR1].SSTA,regaddr1,SENS[devaddr1-SENSOR1].SCTL);
            if (regaddr1==SSIDX)
                PROTOCOL_recvResponse(out_str,devaddr1,SENS[devaddr1-SENSOR1].SSTA,regaddr1,SENS[devaddr1-SENSOR1].SIDX);
            if (regaddr1==SSVAL)
                PROTOCOL_recvResponse(out_str,devaddr1,SENS[devaddr1-SENSOR1].SSTA,regaddr1,SENS[devaddr1-SENSOR1].SVAL);
            if (regaddr1==SSVER)
                PROTOCOL_recvResponse(out_str,devaddr1,SENS[devaddr1-SENSOR1].SSTA,regaddr1,SENSOR_VERSION);
            return NO_ERROR;
        }

        // PWMs
        if ((devaddr1>=PWM1) && (devaddr1<=PWM4))
        {
            if (regaddr1==PPCTL)
                PROTOCOL_recvResponse(out_str,devaddr1,PWM[devaddr1-PWM1].PSTA,regaddr1,PWM[devaddr1-PWM1].PCTL);
            if (regaddr1==PPDUT)
                PROTOCOL_recvResponse(out_str,devaddr1,PWM[devaddr1-PWM1].PSTA,regaddr1,PWM[devaddr1-PWM1].PDUT);
            if (regaddr1==PPPER)
                PROTOCOL_recvResponse(out_str,devaddr1,PWM[devaddr1-PWM1].PSTA,regaddr1,PWM[devaddr1-PWM1].PPER);
            if (regaddr1==PPVER)
                PROTOCOL_recvResponse(out_str,devaddr1,PWM[devaddr1-PWM1].PSTA,regaddr1,PWM_VERSION);
            return NO_ERROR;
        }

        // USARTs
        if ((devaddr1>=USART1) && (devaddr1<=USART7))
        {
            if (regaddr1==UUCTL)
                PROTOCOL_recvResponse(out_str,devaddr1,USART[devaddr1-USART1].USTA,regaddr1,USART[devaddr1-USART1].UCTL);
            if (regaddr1==UUSPD)
                PROTOCOL_recvResponse(out_str,devaddr1,USART[devaddr1-USART1].USTA,regaddr1,USART[devaddr1-USART1].USPD);
            // need status function !!!!!!!!!!!!!!
            if (regaddr1==UUSTA)
                PROTOCOL_recvResponse(out_str,devaddr1,USART[devaddr1-USART1].USTA,regaddr1,USART[devaddr1-USART1].USTA);
            if (regaddr1==UUDAT)
            {
            	if (regval1 & USART_EN)
            	{
            		if (USART_is_data_in_buffer(regval1))
					{
            			PROTOCOL_recvResponse(out_str,devaddr1,USART[devaddr1-USART1].USTA,regaddr1,
            					USART_receive_byte(devaddr1));
					}
            		else
            		{
            			PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,BUFFER_ERROR);
            		}
            	}
            	else
            	{
            		PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,DEV_EN_ERROR);
            	}
            }
            return NO_ERROR;
        }

        // Software PWMs
        if ((devaddr1>=SPWM1) && (devaddr1<=SPWM14))
        {
            if (regaddr1==SPPCTL)
                PROTOCOL_recvResponse(out_str,devaddr1,SPWM[devaddr1-SPWM1].SPSTA,regaddr1,SPWM[devaddr1-SPWM1].SPCTL);
            if (regaddr1==SPPDUT)
                PROTOCOL_recvResponse(out_str,devaddr1,SPWM[devaddr1-SPWM1].SPSTA,regaddr1,SPWM[devaddr1-SPWM1].SPDUT);
            if (regaddr1==SPPPER)
                PROTOCOL_recvResponse(out_str,devaddr1,SPWM[devaddr1-SPWM1].SPSTA,regaddr1,SPWM[devaddr1-SPWM1].SPPER);
            if (regaddr1==SPPVER)
                PROTOCOL_recvResponse(out_str,devaddr1,SPWM[devaddr1-SPWM1].SPSTA,regaddr1,SPWM_VERSION);
            return NO_ERROR;
        }

        // I2Cs
        if ((devaddr1>=I2C1) && (devaddr1<=I2C7))
        {
            I2C_handler(devaddr1);
            if (regaddr1==IICTL)
                PROTOCOL_recvResponse(out_str,devaddr1,I2C[devaddr1-I2C1].ISTA,regaddr1,I2C[devaddr1-I2C1].ICTL);
            if (regaddr1==IIDEV)
                PROTOCOL_recvResponse(out_str,devaddr1,I2C[devaddr1-I2C1].ISTA,regaddr1,I2C[devaddr1-I2C1].IDEV);
            if (regaddr1==IIREG)
                PROTOCOL_recvResponse(out_str,devaddr1,I2C[devaddr1-I2C1].ISTA,regaddr1,I2C[devaddr1-I2C1].IREG);
            if (regaddr1==IIDAT)
                PROTOCOL_recvResponse(out_str,devaddr1,I2C[devaddr1-I2C1].ISTA,regaddr1,I2C[devaddr1-I2C1].IDAT);
            if (regaddr1==IIERR)
                PROTOCOL_recvResponse(out_str,devaddr1,I2C[devaddr1-I2C1].ISTA,regaddr1,I2C[devaddr1-I2C1].IERR);
            if (regaddr1==IIIDX)
                PROTOCOL_recvResponse(out_str,devaddr1,I2C[devaddr1-I2C1].ISTA,regaddr1,I2C[devaddr1-I2C1].IIDX);
            if (regaddr1==IIVAL)
                PROTOCOL_recvResponse(out_str,devaddr1,I2C[devaddr1-I2C1].ISTA,regaddr1,I2C[devaddr1-I2C1].IVAL);
            if (regaddr1==IIPAR)
                PROTOCOL_recvResponse(out_str,devaddr1,I2C[devaddr1-I2C1].ISTA,regaddr1,I2C[devaddr1-I2C1].IPAR);
            if (regaddr1==IIDEL)
                PROTOCOL_recvResponse(out_str,devaddr1,I2C[devaddr1-I2C1].ISTA,regaddr1,Idelay);
            if (regaddr1==IIVER)
                PROTOCOL_recvResponse(out_str,devaddr1,I2C[devaddr1-I2C1].ISTA,regaddr1,I2C_VERSION);
            return NO_ERROR;
        }

